In [6]:
import numpy as np
from IPython.display import display
import pandas as pd

df = pd.DataFrame({'A':[None, 2 , 3 , None, 5 ], 'B': [10 , None, None, 40 , 50 ], 
                   'C': [100 , None, 300 , 400, None]})
display(df)

     A     B      C
0  NaN  10.0  100.0
1  2.0   NaN    NaN
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [16]:
df.dropna(axis = 0)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [18]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [26]:
df.dropna(subset=['A', 'C'], axis = 0)

     A   B      C
2  3.0 NaN  300.0

In [30]:
df = df.fillna(0)
display(df)
df = df.

     A     B      C
0  0.0  10.0  100.0
1  2.0   0.0    0.0
2  3.0   0.0  300.0
3  0.0  40.0  400.0
4  5.0  50.0    0.0

In [39]:
df = pd.DataFrame({'A':[None, 2 , 3 , None, 5 ], 'B': [10 , None, None, 40 , 50 ], 
                   'C': [100 , None, 300 , 400, None]})

df['B'] = df['B'].fillna(df['B'].mean())
display(df)

     A          B      C
0  NaN  10.000000  100.0
1  2.0  33.333333    NaN
2  3.0  33.333333  300.0
3  NaN  40.000000  400.0
4  5.0  50.000000    NaN